---
kind: property
id: P:Autodesk.Revit.DB.Sweep.MaxSegmentAngle
source: html/78f5b5dc-922d-0a67-c3dc-b787bcfb0403.htm
---
# Autodesk.Revit.DB.Sweep.MaxSegmentAngle Property

The maximum segment angle of the sweep in radians.

## Syntax (C#)
```csharp
public double MaxSegmentAngle { get; set; }
```

## Remarks
This property is used to retrieve/set the maximum segment angle of the sweep. It
is settable only when the trajectory segmentation is enabled.